[
    {
        "text": "Over the years,  as an educator, my biggest focus has been solving students’ problems and answering their questions.\nIt’s something that’s driven me every single day.\nBut starting my own website and now leading a team of 20+ people has taken that responsibility to a whole new level.\nIt’s no longer just about helping students with their doubts—it's also about empowering my team to grow and thrive.\nThis journey, from educator to entrepreneur, started with one simple thing: a vision and an idea to make a difference in the field of education.\nIf you’ve ever had an idea that you felt could create real change, I would help you with something you should check out.\nNovartis, a global pharmaceutical company, is giving you the chance to bring your ideas to life.\nThey’re hosting a case-based competition to solve real-world challenges, and it’s open to everyone—students, startups, and incubators.\nPlus, there’s ₹8 lakhs determined as the prize money.\nBeyond that, you’ll get mentorship from industry leaders, and all National Finalists will have a shot at a pre-placement interview.\nYou can take that idea in your head and turn it into something groundbreaking in the world of medicine.\nCheck it out: https://lnkd.in/dtj5c8uuUnstop",
        "engagement": 3289,
        "line_count": 12,
        "language": "Hinglish",
        "tags": [
            "Innovation",
            "Education"
        ]
    },
    {
        "text": "I don’t trust many people when it comes to influencers , but Priyansh is one of the few I truly respect.\nThe reason is simple—he always keeps the customer’s best interest at heart, which is something we also believe in at takeUforward.\nI met him a couple of years ago when he had started TLE Eliminators, the only platform that treats competitive programming as a sport, not just an interview prep tool.\nWe had a great conversation where he shared a lot of ideas, and now, seeing TLE grow to over 10K+ paid users over the last 3.5 years and seeing so many of those ideas come to life feels really fulfilling.\nThe feedback on TLE has been fantastic, especially about their doubt support, which is so crucial in CP.\nIf you’re someone serious about CP, you really don’t need to look anywhere else.\nThey've completed 11 batches of their CP course and their 12th batch is here, so I’d recommend checking them out—you definitely won’t regret it.\nLink: https://lnkd.in/dAKZc8_y",
        "engagement": 5807,
        "line_count": 9,
        "language": "Hinglish",
        "tags": [
            "TLE Eliminators",
            "Take U Forward"
        ]
    },
    {
        "text": "Last year, while working abroad, my focus was on professional growth and new experiences.\nDuring the initial career phase, everyone does overlook the importance of financial and risk management but it only takes one mishap to regret your negligence.\nWith me being the only earning member of my family, I realized how crucial it was to get a term life insurance policy.\nIt’s a myth that only elders or those with families need insurance; it’s vital for anyone who wants to protect their loved ones.\nYou need to ensure that your loved ones would be financially secure if anything happens.\nHere are a few key takeaways from my research that might help others:\n1. Getting term insurance early is cheaper. If you start around 25, premiums for a ₹1 crore cover are much lower than if you wait.\n2. Even without kids or a spouse, your parents or siblings might rely on you financially, making it essential to have coverage.\n3. Term insurance offers tax savings under section 80C, which is always a nice bonus.\nI would suggest you check Ditto Insurance as they’ll be of great help if you're at your initial phase to start your insurance journey.\nTheir services are honest and they will help you learn more.\nThey provide their consultation services free of cost so it can benefit you all with zero spam calls and great financial insights.\nIf you're interested you can book a call with them: https://ditto.sh/b9cwsi",
        "engagement": 8492,
        "line_count": 11,
        "language": "Hinglish",
        "tags": [
            "Term Insurance",
            "Financial Planning"
        ]
    },
    {
        "text": "Our team has been working tirelessly over the last two months to give TUF and TUF+ users the best possible experience for learning and mastering DSA.\nHere are some stats that show the trust of our users:\n- The roadmap feature, which structures your learning, is used by about 95% of our users daily.\n- Around 25% of TUF+ users visit the platform daily.\n- Approximately 30% of TUF+ users have completed more than 30% of their course so far.\n- Bug reports have dropped to single digits over the past week.\n- On average, TUF+ users solve 3 problems each day.\nThis Diwali, we’re excited to bring you the much-anticipated Strings section!\nWe’re also running a special Diwali sale, offering TUF+ at its lowest-ever lifetime price.\nIf you're looking for an organised, all-in-one solution to learn DSA without wasting time searching for resources, TUF and TUF+ are here to help.\nCheckout the features here: https://lnkd.in/dc34VV8t",
        "engagement": 7847,
        "line_count": 14,
        "language": "Hinglish",
        "tags": [
            "Learning",
            "DSA"
        ]
    },
    {
        "text": "Hi everyone,\nI hope you guys are doing extremely well.\nI’ve decided to step away from content creation for now.\nLately, I’ve been going through a tough time in my personal life, which makes it hard for me to focus or get in front of the camera to shoot.\nWill I return? I’m not sure at this point.\nI’m not in the right frame of mind to think about it right now.\nWhat about TUF+? It will continue to run smoothly, with the team managing everything as a priority.\nWe have 15 videos left, and they will be uploaded soon.\nYou might still see some text content on my social media, which will be handled by our team.\nWe also have a few prior commitments with brands and colleges, but after that, I won’t be around much.\nGood luck.",
        "engagement": 15667,
        "line_count": 11,
        "language": "English",
        "tags": [
            "TUF+",
            "Content Creation"
        ]
    },
    {
        "text": "Don’t cry in a corner, if you want something, mehnat kar, best ban, aur cheen le.\nThank you Parth Tandon for the amazing click.\nIf you need a structured path for your preparation where you get everything at one place, check out TUF+.\nUse code 'SPECIAL' to get the maximum discount.\nLink: https://lnkd.in/dzH_jXH2",
        "engagement": 10734,
        "line_count": 6,
        "language": "Hinglish",
        "tags": [
            "TUF+",
            "Parth Tandon"
        ]
    },
    {
        "text": "Powering the future of AI-driven workflows! AMD Ryzen™️ AI 300 PRO Series stands out with 'superior multitasking, AI acceleration, and extended battery life compared to Intel Core Ultra. With up to 12 high-performance cores and 50 TOPS of AI power, AMD ensures seamless efficiency for enterprise applications. You can experience industry-leading security, optimized performance, and next-level computing designed for modern professionals. The future is AI-powered—are you ready?",
        "engagement": 483,
        "line_count": 5,
        "language": "English",
        "tags": [
            "AI",
            "AMD Ryzen"
        ]
    },
    {
        "text": "Life update, this didn’t happen overnight, in case you’re quick to jump to conclusions. For the last 5 years, I’ve worked 14-15+ hours a day. If you zoom in on the submission time in the left picture, you’ll get an idea. Balancing a full-time job, studying, and recording videos late at night hasn’t been easy. But it was worth it. All I can say is thank you 🙏🏻 Keep working hard, there’s no substitute for it.",
        "engagement": 29455,
        "line_count": 6,
        "language": "English",
        "tags": [
            "Hard Work",
            "Persistence"
        ]
    },
    {
        "text": "Where is takeUforward heading? This is a question everyone is asking. Our vision is to offer a single subscription that covers everything, eliminating the need to purchase multiple courses or premium plans. What the current TUF+ subscription offers - DSA (Beginners to Advanced) - DSA (Last month/week preparation) - Core Subjects (Notes + Videos rolling out) - OOPs (Videos + Practice) - Practice portal (company tags, hints, interview follow-up questions, most frequently asked doubts, AI doubt support) - Daily planner - Customised roadmap according to your number of days - High quality write-ups for everything to make revision easy. - Download (all) notes feature for revision. What we are adding in V3 - LLD (videos + practice) - Aptitude - 700+ premium questions for practice. - Company tag filter (listwise) - DSA (WITCH) Valentine’s day sale is on: https://lnkd.in/dvHnSdBc Use code: 35KATEGA",
        "engagement": 3947,
        "line_count": 7,
        "language": "Hinglish",
        "tags": [
            "V3",
            "Take U Forward"
        ]
    },
    {
        "text": "Marketing has evolved widely over the years, from radio ads with just audio to print advertisements and now an entirely digital era. With Valentine's Week in full swing, multiple brands are launching creative marketing campaigns, as it is known to be the peak season for gifting. One campaign that stood out to me was a unique print ad in The Times of India by Fabelle Chocolates that I saw yesterday. At first glance, the ad appeared quite minimalistic, but it featured a QR code that, when scanned, unlocked a great VR experience. This campaign was innovative and also perfectly aligned with their brand messaging. The ad had royalty, luxury, and premium appeal in every aspect. Shoutout to the copywriter who thought of the sweet and witty one-liners for each element. Chocolates and Valentine’s Day are inseparable, and introducing such an interactive concept while highlighting flavours inspired by nature is a smart move: earth, water, fire, air and space. While reading the article states having a sensorial taste with each bite and honestly, with ingredients like Acacia Nectar, French Sea Salt, Candied Mango, and Ancho Chilli I don't doubt them. Promoting premium products is always a challenge, but leveraging advanced VR marketing would help this campaign gain more traction. I know for sure my team and I would love to get our hands on this!",
        "engagement": 611,
        "line_count": 11,
        "language": "English",
        "tags": [
            "Valentine's Day",
            "Marketing"
        ]
    },
    {
        "text": "It took me 5 years to get a dedicated studio for myself 🙌 Most of my previous videos were shot at 12-3 AM, when I got time after my work also primarily to avoid outside noise. Now I can shoot during evening hours too. Whatever you do, give your all, and it will give you back in some way or the other 😇",
        "engagement": 15289,
        "line_count": 3,
        "language": "Hinglish",
        "tags": [
            "Motivation",
            "Hard Work"
        ]
    },
    {
        "text": "Quick commerce has transformed the way we shop. It has over 25 million active users who rely on it for essentials as it delivers super quickly. This was all made possible by modern technology, particularly AI-powered algorithms, advanced data management, and streamlined customer support systems. For someone like me, living alone, access to medications and healthcare essentials is a top priority. Apollo 24|7 has addressed this need by bringing multiple healthcare services together on one platform. It delivers medicines within 19-29 minutes in 6+ cities and also offers online doctor consultations with other medical services. Also, their Circle Membership adds a lot of value with its benefits. It’s great to see them make such meaningful contributions to society while achieving excellent growth under innovative leadership.",
        "engagement": 3395,
        "line_count": 7,
        "language": "English",
        "tags": [
            "Quick Commerce",
            "Apollo 24|7"
        ]
    },
    {
        "text": "Five years ago, I started with ₹2500 for 3 to 3.5 hours of continuous teaching sessions before I had my YT for an edtech. For about a year, I was teaching for 9–10 hours on Saturdays and Sundays as well. This eventually took a toll on my health, leading to a neck surgery (the scar you see on my neck is a reminder of that). The last online paid teaching session I conducted was a couple of years ago, for ₹75,000 per hour. Since then, I have focused exclusively on being available through my platform takeUforward. Remember, no starting point is too small. With the right mindset and skills, you will eventually achieve success, it can be any profession. I take bi-weekly sessions on TUF+ platform where all of us connect usually: takeuforward.org/plus",
        "engagement": 11288,
        "line_count": 7,
        "language": "English",
        "tags": [
            "Online Teaching",
            "EdTech"
        ]
    }
]